## Parsing and Manipulating Text
---
### Reformatting string and character data

Convertir cadenas de texto u manejarlas segun nuestras necesidades es tambien parte de los motores de base de datos. Por ello, postgresql incluye clausulas y operadores para este tipo de datos.


- `||` operator: podemos concatenar cadenas de texto escribiendo el doble pipe operator. E.g:
    ```sql
        SELECT first_name || ' ' || last_name FROM customer
    ```
- `CONCAT( first_element, sec_elem, ...)`: la funcion concatena las diferentes cadenas de texto. 
```sql
    SELECT CONCAT(first_name, ' ', last_name, ' ' ,email)
```
- `UPPER(email)`: retorna una cadena con mayusculas 
- `LOWER(email)`:  retorna una cadena en minusculas
- `INITCAP(email)`: retorna la cadena inicial con mayusculas
- `REPLACE(source , 'string to replace', 'new string')`: reemplaza una cadena de texto por otra.

---


LINEAS DE CONFIGURACION


---

In [ ]:
import sqlalchemy as sqla

engine = sqla.create_engine('postgresql://postgres:Panama2021@localhost:5433/dvdrental')

%load_ext sql
%sql $engine.url

'Connected: postgres@dvdrental'

In [7]:
%sql SELECT customer_id || ': ' || first_name || ' ' || last_name AS ID_NAME  FROM customer LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('524: Jared Ely',),
 ('1: Mary Smith',),
 ('2: Patricia Johnson',),
 ('3: Linda Williams',),
 ('4: Barbara Jones',)]

In [14]:
%sql SELECT CONCAT(first_name, ' ', last_name) FROM customer LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('Jared Ely',),
 ('Mary Smith',),
 ('Patricia Johnson',),
 ('Linda Williams',),
 ('Barbara Jones',)]

In [12]:
%sql SELECT UPPER (first_name || ' ' || last_name) as NAME_UPP FROM customer LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('JARED ELY',),
 ('MARY SMITH',),
 ('PATRICIA JOHNSON',),
 ('LINDA WILLIAMS',),
 ('BARBARA JONES',)]

In [15]:
%sql SELECT LOWER (first_name || ' ' || last_name) as NAME_UPP FROM customer LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('jared ely',),
 ('mary smith',),
 ('patricia johnson',),
 ('linda williams',),
 ('barbara jones',)]

In [32]:
%sql SELECT INITCAP(title) FROM film limit 10

 * postgresql://postgres:***@localhost:5433/dvdrental
10 rows affected.

[('Chamber Italian',),
 ('Grosse Wonderful',),
 ('Airport Pollock',),
 ('Bright Encounters',),
 ('Academy Dinosaur',),
 ('Ace Goldfinger',),
 ('Adaptation Holes',),
 ('Affair Prejudice',),
 ('African Egg',),
 ('Agent Truman',)]

In [34]:
%sql SELECT description, REPLACE(description, ' ', '') FROM film limit 10

 * postgresql://postgres:***@localhost:5433/dvdrental
10 rows affected.

[('A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 'A_Fateful_Reflection_of_a_Moose_And_a_Husband_who_must_Overcome_a_Monkey_in_Nigeria'),
 ('A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 'A_Epic_Drama_of_a_Cat_And_a_Explorer_who_must_Redeem_a_Moose_in_Australia'),
 ('A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 'A_Epic_Tale_of_a_Moose_And_a_Girl_who_must_Confront_a_Monkey_in_Ancient_India'),
 ('A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 'A_Fateful_Yarn_of_a_Lumberjack_And_a_Feminist_who_must_Conquer_a_Student_in_A_Jet_Boat'),
 ('A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 'A_Epic_Drama_of_a_Feminist_And_a_Mad_Scientist_who_must_Battle_a_Teacher_in_The_Canadian_Rockies'),
 ('A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 'A_Astounding_Epistle_of_a_Database_Administrator_And_a_Explorer_who_must_Find_a_Car_in_Ancient_China'),
 ('A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 'A_Astounding_Reflection_of_a_Lumberjack_And_a_Car_who_must_Sink_a_Lumberjack_in_A_Baloon_Factory'),
 ('A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 'A_Fanciful_Documentary_of_a_Frisbee_And_a_Lumberjack_who_must_Chase_a_Monkey_in_A_Shark_Tank'),
 ('A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 'A_Fast-Paced_Documentary_of_a_Pastry_Chef_And_a_Dentist_who_must_Pursue_a_Forensic_Psychologist_in_The_Gulf_of_Mexico'),
 ('A Intrepid Panorama of a Robot And a Boy who must Escape a Sumo Wrestler in Ancient China', 'A_Intrepid_Panorama_of_a_Robot_And_a_Boy_who_must_Escape_a_Sumo_Wrestler_in_Ancient_China')]

In [36]:

### REVERSE

%sql SELECT REVERSE(description) FROM film limit 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('airegiN ni yeknoM a emocrevO tsum ohw dnabsuH a dnA esooM a fo noitcelfeR lufetaF A',),
 ('ailartsuA ni esooM a meedeR tsum ohw rerolpxE a dnA taC a fo amarD cipE A',),
 ('aidnI tneicnA ni yeknoM a tnorfnoC tsum ohw lriG a dnA esooM a fo elaT cipE A',),
 ('taoB teJ A ni tnedutS a reuqnoC tsum ohw tsinimeF a dnA kcajrebmuL a fo nraY lufetaF A',),
 ('seikcoR naidanaC ehT ni rehcaeT a elttaB tsum ohw tsitneicS daM a dnA tsinimeF a fo amarD cipE A',)]

### Analisis de cadenas de texto

Las cadenas de texto tambien pueden ser manejadas a nivel de numero de caracteres; en ocasiones podemos necesitar solamente el el dominio de usuario de un correo electronico o separar textos hasta el siguiente punto.

- `CHAR_LENGTH`: devuelve la cantiad de caracteres
- `LENGTH(source)`: es igual a char_length 
- `LEFT(source, n)`: cuenta desde izquierda a derecha (n) cantidad de caracteres
- `RIGHT(source, n)`: cuenta desde derecha a izquierda (n) cantidad de caracteres
- `POSITION(@ IN email)`: devuelve la posicion de `@` (arroba) dentro del source **email**.
- `STRPOS (email, '@')`: devuelve la posicion de `@` dentro del source **email** 
- `SUBSTRING(source, 10,50)`: devuelve los caracteres desde 10 a 50 del source column.

```sql
--SUBSTRING tambien acepta la clausula FROM x FOR x
SELECT SUBSTRNG( email FROM 0 FOR POSITION('@' IN email))
```

- `SUBSTR(source,10,50)`: es una funcion analoga a `SUBSTRING`

In [39]:
%sql SELECT description ,LENGTH(description) as Tamanio FROM film LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 83),
 ('A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 73),
 ('A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 77),
 ('A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 86),
 ('A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 96)]

In [41]:
%sql SELECT description ,LEFT(description, 15) as Tamanio FROM film LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 'A Fateful Refle'),
 ('A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 'A Epic Drama of'),
 ('A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 'A Epic Tale of '),
 ('A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 'A Fateful Yarn '),
 ('A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 'A Epic Drama of')]

In [48]:
%sql SELECT description ,RIGHT(description, 15) as Tamanio FROM film LIMIT 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[('A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 'nkey in Nigeria'),
 ('A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 'se in Australia'),
 ('A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 'n Ancient India'),
 ('A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 't in A Jet Boat'),
 ('A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 'anadian Rockies')]

In [51]:
%sql SELECT POSITION('@' IN email) FROM customer limit 5

 * postgresql://postgres:***@localhost:5433/dvdrental
5 rows affected.

[(10,), (11,), (17,), (15,), (14,)]

In [55]:
# GETTING 
%sql SELECT SUBSTRING ( email FROM 0 FOR POSITION('@' IN EMAIL)) AS USER, email FROM customer LIMIT 10

 * postgresql://postgres:***@localhost:5433/dvdrental
10 rows affected.

[('jared.ely', 'jared.ely@sakilacustomer.org'),
 ('mary.smith', 'mary.smith@sakilacustomer.org'),
 ('patricia.johnson', 'patricia.johnson@sakilacustomer.org'),
 ('linda.williams', 'linda.williams@sakilacustomer.org'),
 ('barbara.jones', 'barbara.jones@sakilacustomer.org'),
 ('elizabeth.brown', 'elizabeth.brown@sakilacustomer.org'),
 ('jennifer.davis', 'jennifer.davis@sakilacustomer.org'),
 ('maria.miller', 'maria.miller@sakilacustomer.org'),
 ('susan.wilson', 'susan.wilson@sakilacustomer.org'),
 ('margaret.moore', 'margaret.moore@sakilacustomer.org')]


### Truncar y espaciar String Data

- `TRIM( [ leading| trailing | both ] [character] FROM string)`
    - Primer parametro: el primer parametro es **opcional** y por default tiene el valor de **both**
    - Segundo parametro: es el caracter que sera eliminado de la cadena es **opcional**.
    - Tercer parametro: es la cadena sobre la cual actuaremos
- `LTRIM`: buscamos todos los espacios en blanco de izquierda a derecha.
- `RTRIM`: buscamos todos los espacios en blanco de derecha a izquierda. 
- `LPAD(string, n, caracter)`: agregara a la izquierda una determinada cantidad de caracteres para resultar en un total de `n` caracteres, si no especificamos el `caracter` se agrega solamente un espacio en blanco `(' ')`. 
- `RPAD(string, n, caracter)`: agregara a la derecha una determinada cantidad de caracteres para resultar en un total de `n` caracteres, si no especificamos el `caracter` se agrega solamente un espacio en blanco `(' ')`.

In [67]:
#BUSCARA el caracter # desde el inicio y lo eliminara 
%sql SELECT TRIM( LEADING '#' FROM  '#__#__stringsample %%')

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('__#__stringsample %%',)]

In [72]:
#BUSCARA el caracter espacio desde la izquierda y los eliminara
%sql SELECT LTRIM( '  stringsample %%')

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('stringsample %%',)]

In [73]:
%sql SELECT RTRIM( 'stringsample %%   ')

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('stringsample %%',)]

In [86]:
#aggrega a su izquierda x cantidad de dash's para resultar en 15 caracteres finales
%sql SELECT LPAD('pad',15, '\')

 * postgresql://postgres:***@localhost:5433/dvdrental
1 rows affected.

[('\\\\\\\\\\\\\\\\\\\\\\\\pad',)]